# Taps
tap "homebrew/bundle"
tap "homebrew/cask-fonts"

# Terminal & Shell Tools
brew "starship"              # Cross-shell prompt
brew "zoxide"                # Smarter cd command
brew "fzf"                   # Fuzzy finder
brew "thefuck"              # Command correction

# Development Tools
brew "git"                   # Version control
brew "node"                  # Node.js runtime

# Python (dependency for thefuck)
brew "python@3.13"

# Casks (GUI Applications)
cask "iterm2"               # Terminal emulator
cask "font-hack-nerd-font"  # Nerd Font for terminal

# Editor & IDE
brew "neovim"               # Neovim editor
brew "ripgrep"             # Fast grep (required for telescope)
brew "fd"                  # Fast find (required for telescope)
brew "lazygit"             # Git UI for LazyVim
brew "lua"                 # Lua interpreter
brew "luarocks"            # Lua package manager

# Optional: Add more development tools as needed
# brew "docker"
# brew "gh"                  # GitHub CLI
# brew "jq"                  # JSON processor
# brew "bat"                # Better cat
# brew "eza"                # Better ls
# brew "httpie"             # Better curl

# Optional: More casks
# cask "visual-studio-code"
# cask "slack"
# cask "discord"
# cask "spotify"

# Mac App Store apps (requires mas to be installed)
# mas "Xcode", id: 497799835