# Taps

# Terminal & Shell Tools
brew "starship"
brew "zoxide"
brew "fzf"
brew "thefuck"
brew "eza"
brew "bat"

# Development Tools
brew "git"
brew "node"

# Python
brew "python@3.13"

# Casks (GUI Applications)
cask "iterm2"
cask "font-hack-nerd-font"

# Editor & IDE
brew "neovim"
brew "ripgrep"
brew "fd"
brew "lazygit"
brew "lua"
brew "luarocks"

# Optional: Add more development tools as needed
# brew "docker"
# brew "gh"
# brew "jq"
# brew "httpie"

# Optional: More casks
# cask "visual-studio-code"
# cask "slack"
# cask "discord"
# cask "spotify"

# Mac App Store apps (requires mas to be installed)
# mas "Xcode", id: 497799835